Examinator/src/InformationRegisters/ТестыНаПроверкуСУЗ/ТестыНаПроверкуСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТестыНаПроверкуСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТестыНаПроверкуСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТестыНаПроверкуПрохожденияОбучения(Пользователь, ПрохождениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестыНаПроверкуСУЗ.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ТестыНаПроверкуСУЗ.ЭлементСодержания КАК ЭлементСодержания,
		|	ТестыНаПроверкуСУЗ.ПрохождениеОбучения КАК ПрохождениеОбучения,
		|	ТестыНаПроверкуСУЗ.Задание КАК Задание,
		|	ТестыНаПроверкуСУЗ.Пользователь КАК Пользователь,
		|	ТестыНаПроверкуСУЗ.Период КАК Дата,
		|	ТестыНаПроверкуСУЗ.ЭлектронныйРесурс.Наименование КАК НаименованиеЗадания,
		|	ТестыНаПроверкуСУЗ.Регистратор КАК Регистратор,
		|	ТестыНаПроверкуСУЗ.ПрохождениеОбучения.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ТестыНаПроверкуСУЗ КАК ТестыНаПроверкуСУЗ
		|ГДЕ
		|	ТестыНаПроверкуСУЗ.Проверен = ЛОЖЬ
		|	И ТестыНаПроверкуСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ТестыНаПроверкуСУЗ.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
